import math

a = str("Apple")
b = str("Yuogurt")
c = str("Salo")
d = str("Voda")
#_________________________________________________________________________________________________
print("_"*100)
print(" "*100)

print(a)
print(b)
print(c)
print(d)

print(" "*100)
print('║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║')
print(" "*100)


print(a,b,c,d)
print(" "*100)


lis = list(" 'Apple','Yuogurt','Salo','Voda'")
vvod = str(input("Введите название товара = "))

if bool(vvod) == lis:
    print("Есть такой товар!")
else:
    print("Нету такого товара!")



#Сделана проверка :)




print(" "*100)
print('║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║')
print(" "*100)




tovar = str("'Apple','Yuogurt','Salo','Voda'")

if 'Apple' in tovar:
    print("Яблоки есть!")
else:
    print("Яблок нету(")



if 'Yuogurt' in tovar:
    print("Йогурт есть есть!")
else:
    print("Йогурта нету(")


if 'Salo' in tovar:
    print("Сало есть!")
else:
    print("Сала нету(")


if 'Voda' in tovar:
    print("Вода есть!")
else:
    print("Воды нету(")

#Сделана проверка :)


print("  "*50)
print("  "*50)
print('║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║')
print("  "*50)
#___________________________________________________________________________________________________


Apple = 3
Yuogurt = 20
Salo = 50
Voda = 5
all_value = (Apple+Yuogurt+Salo+Voda)
print('Общее количество товара :',all_value)

print("  "*50)
print("  "*50)
print('║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║')
print("  "*50)

friends = {
    ("Vasya") : "Apple",
    ("Stopa") : "Yuogurt",
    ("Lila") : "Salo",
    ("Vanya") : 'Voda',
}

print(friends)
#_____________________________________________________________________________________________________

#Длолжны быть проверка на уникальность товара и друзей на уникальность

name1 = 'Vasya'
name2 = 'Stopa'
name3 = ' Lila'
name4 = 'Vanya'

print(f"Apple is for {name1}")
print(" "*100)
print('║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║')
print(" "*100)

print(f"Yuogurt is for {name2}")
print(" "*100)
print('║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║')
print(" "*100)

print(f"Salo is for {name3}")
print(" "*100)
print('║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║')
print(" "*100)

print(f"Voda is for {name4}")
print(" "*100)
print('║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║')
print(" "*100)

#_____________________________________________________________________________________________________




#Тут должна быть проверка

#_______________________________________________________________________________________________________

Apple = 4
Yuogurt = 15
Salo = 40
Voda = 5
all_sum = (Apple+Yuogurt+Salo+Voda)
print("Общая цена товара: ",all_sum)
print("Цена яблока:",Apple)
print("Цена йогурта: ",Yuogurt)
print("Цена сала: ",Salo)
print("Цена воды: ",Voda)

print(" "*100)
print('║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║')
print(" "*100)


Ap = 4
Yu = 15
Sa = 40
Vo = 5

A = str(input("Введите количество Apple: "))
print(" "*100)
print('║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║')
print(" "*100)

B = str(input("Введите колчество Yuogurt: "))
print(" "*100)
print('║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║')
print(" "*100)

C = str(input("Введите количество Salo: "))
print(" "*100)
print('║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║')
print(" "*100)
D = str(input("Введите количество Voda: "))
print(" "*100)
print('║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║')
print(" "*100)

print('║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║║▌│█║▌│█║▌│█│║▌║█│▌║█│▌║')





z1 = A * Ap
z2 = B * Yu
z3 = C * Sa
z4 = D * Vo
z5 = z1+z2+z3+z4


money_vasya = 35
money_stopa = 5
money_lila = 100
money_vanya = 50


if money_vasya <= z5:
    print("Vasya can't buy this stuff")
else:
    print('Vasya buy all dat stuff')
print('')
if money_stopa <= z5:
    print("Igor cant't buy dat stuff")
else:
    print("Igor buy all dat stuff")

print('')

if money_lila <= z5:
    print("Tolia can't buy dat stuff")
else  :
    print("Tolia  buy dat stuff")

print('')

if money_vanya <= z5:
    print("Tolia can't buy dat stuff")
else  :
    print("Tolia  buy dat stuff")

#
print("Цена яблок на выходе: ",z1)
print("Цена йогурта на выходе: ",z2)
print("Цена сала на выходе: ",z3)
print("Цена воды на выходе: ",z4)

print(" ")

#Тут должна быть проверка...
#_________________________________________________________________________________________________________

print("  "*50)
print("_"*100)
print("  "*50)
print(f"{name1} bring Apple to {name2} and {name2} пабыраму продал его на базаре)")